const ar_AE = {
  title: 'إعدادات الإشعارات',
  webhooks: {
    help_content:
      'آلية الاستدعاء (Webhook) تُستخدم للتكامل بين Nightingale والأنظمة الأخرى. بعد إنشاء حدث تنبيه، سيقوم Nightingale بإرساله إلى عناوين الاستدعاء المختلفة. يمكنك تطوير واجهة برمجة تطبيقات HTTP API خاصة بك وتكوينها هنا لاستقبال أحداث التنبيه ومعالجتها برمجياً بشكل مخصص ومؤتمت. يستخدم Nightingale طريقة POST لإرسال البيانات بتنسيق JSON في جسم طلب HTTP. للحصول على هيكل بيانات الحدث، يرجى مراجعة [هنا](https://github.com/ccfos/nightingale/blob/main/models/alert_cur_event.go#L19). يمكنك استخدام جهاز متصل بنفس شبكة Nightingale (بافتراض أن عنوان IP هو 10.1.2.3) وتشغيل أمر nc للاستماع، مثل `nc -k -l 4321` للاستماع على المنفذ 4321، ثم قم بتهيئة الرابط `http://10.1.2.3:4321` في عناوين الاستدعاء. بمجرد إطلاق قاعدة تنبيه، سيرسل Nightingale البيانات إلى هذا العنوان، وستتمكن من رؤية تفاصيل تنسيق البيانات في مخرجات أمر nc.',
    title: 'عناوين الاستدعاء (Webhooks)',
    enable: 'تفعيل',
    note: 'ملاحظة',
    url: 'رابط URL',
    timeout: 'المهلة (بالثواني)',
    basic_auth_user: 'اسم المستخدم (Basic Auth)',
    basic_auth_password: 'كلمة المرور (Basic Auth)',
    skip_verify: 'تخطي التحقق من SSL',
    add: 'إضافة',
    help: `
      إذا كنت ترغب في توجيه جميع أحداث تنبيه Nightingale إلى منصة أخرى لمعالجتها، يمكنك القيام بذلك عبر عناوين الاستدعاء العامة هنا.
      <br />
      <br />
      بشكل عام، تركز أنظمة المراقبة على جمع البيانات، تخزينها، تحليلها، وتوليد أحداث التنبيه. أما المهام اللاحقة مثل توزيع الأحداث، تقليل الضجيج، التكليف، التصعيد، المناوبات، والتعاون، فعادةً ما يتم حلها بواسطة منتجات مستقلة تُعرف باسم منتجات "OnCall" لإدارة الأحداث، وهي مستخدمة على نطاق واسع في الشركات التي تطبق مفاهيم SRE.
      <br />
      <br />
      يمكن لمنتجات OnCall الارتباط بمختلف أنظمة المراقبة مثل Prometheus و Nightingale و Zabbix و ElastAlert وأنظمة المراقبة السحابية. ترسل هذه الأنظمة التنبيهات إلى مركز OnCall عبر الـ WebHook، حيث يقوم المستخدمون بإدارة العمليات اللاحقة من معالجة وتوزيع.
      <br />
      <br />
      عالمياً، يعتبر منتج <a1>PagerDuty</a1> هو الرائد، ومحلياً نوصي بـ <a2>FlashDuty</a2>؛ يمكنكم التسجيل لتجربتها مجاناً.
    `,
  },
  script: {
    title: 'سكربت الإشعارات',
    enable: 'تفعيل',
    timeout: 'المهلة (بالثواني)',
    type: ['استخدام سكربت', 'استخدام مسار'],
    path: 'مسار الملف',
    content: 'محتوى السكربت',
  },
  channels: {
    title: 'وسائط الإشعارات',
    name: 'الاسم',
    ident: 'المعرف',
    ident_msg1: 'يجب أن يحتوي المعرف على أحرف، أرقام، شرطة سفلية أو شرطة فقط',
    ident_msg2: 'هذا المعرف موجود بالفعل',
    hide: 'إخفاء',
    add: 'إضافة',
    add_title: 'إضافة وسيط إشعارات',
    edit_title: 'تعديل وسيط إشعارات',
    enabled: 'مفعل',
  },
  contacts: {
    title: 'معلومات الاتصال',
    add_title: 'إضافة معلومات اتصال',
    edit_title: 'تعديل معلومات اتصال',
  },
  smtp: {
    title: 'إعدادات SMTP',
    testMessage: 'تم إرسال بريد اختبار، يرجى التحقق من صندوق الوارد',
  },
  ibex: {
    title: 'تكوين الإصلاح التلقائي (Self-healing)',
  },
};

export default ar_AE;
