const ar_AE = {
  title: 'قواعد الاشتراك',
  search_placeholder: 'البحث في اسم الاشتراك، القاعدة المشتركة، العلامات، أو فرق الاستلام',
  rule_name: 'القاعدة المشتركة',
  sub_rule_name: 'قاعدة تنبيه الاشتراك',
  sub_rule_selected: 'القواعد المختارة',
  tags: 'علامات الاشتراك',
  user_groups: 'فرق استلام التنبيهات',
  notify_rule_ids: 'قواعد الإشعارات',
  tag: {
    key: {
      label: 'مفتاح علامة حدث الاشتراك',
      tip: 'تشير العلامات هنا إلى علامات أحداث التنبيه؛ يتم تصفية الأحداث بناءً على قواعد مطابقة العلامات التالية',
      required: 'مفتاح العلامة لا يمكن أن يكون فارغاً',
      placeholder: 'يرجى إدخال مفتاح العلامة',
    },
    func: {
      label: 'عامل التشغيل',
    },
    value: {
      label: 'قيمة العلامة',
      equal_placeholder: 'يرجى إدخال القيمة',
      include_placeholder: 'يمكن إدخال قيم متعددة، مفصولة بمفتاح Enter',
      regex_placeholder: 'يرجى إدخال تعبير نمطي (Regex) للمطابقة',
      required: 'قيمة العلامة لا يمكن أن تكون فارغة',
    },
  },
  group: {
    key: {
      label: 'مجموعة عمل الاشتراك',
      placeholder: 'مجموعة العمل',
    },
    func: {
      label: 'عامل التشغيل',
    },
    value: {
      label: 'القيمة',
      required: 'القيمة لا يمكن أن تكون فارغة',
    },
  },
  redefine_severity: 'إعادة تعريف مستوى التنبيه',
  redefine_channels: 'إعادة تعريف وسائط الإشعارات',
  redefine_webhooks: 'إعادة تعريف عناوين Webhook',
  user_group_ids: 'فرق استلام تنبيهات الاشتراك',
  for_duration: 'مدة استمرار الحدث تتجاوز (ثانية)',
  for_duration_tip:
    'مثال: إذا تم ضبط القيمة على 300، فلن يتم مطابقة الحدث عند ظهوره لأول مرة. في المرات التالية، سيتم حساب الفرق بين وقت التنبيه الحالي ووقت التنبيه الأول؛ إذا تجاوز الفرق 300 ثانية، سيتم تنفيذ منطق الإشعار. يمكن استخدام هذه الميزة كآلية تصعيد (Escalation)، حيث يمكن للمسؤولين ضبط مدة تتجاوز ساعة (3600 ثانية) لضمان متابعة التنبيهات الحرجة.',
  webhooks: 'عنوان Webhook جديد',
  webhooks_msg: 'عنوان Webhook لا يمكن أن يكون فارغاً',
  prod: 'نوع المراقبة',
  subscribe_btn: 'اشتراك',
  basic_configs: 'التكوين الأساسي',
  severities: 'مستويات أحداث الاشتراك',
  severities_msg: 'مستويات أحداث الاشتراك لا يمكن أن تكون فارغة',
  tags_groups_require: 'يجب ملء العلامات أو فرق الاستلام على الأقل',
  note: 'اسم الاشتراك',
  filter_configs: 'تكوين التصفية',
  notify_configs: 'تكوين الإشعارات',
  and: 'و',
  btn_add_rule: 'إضافة قاعدة',
};
export default ar_AE;
