const ar_AE = {
  append_tags_msg: 'تنسيق العلامة غير صحيح، يرجى التحقق!',
  append_tags_msg1: 'يجب أن يكون طول العلامة 64 حرفاً أو أقل',
  append_tags_msg2: 'يجب أن يكون تنسيق العلامة key=value. ويجب أن يبدأ المفتاح (key) بحرف أو شرطة سفلية، ويتكون من أحرف وأرقام وشرطات سفلية فقط.',
  append_tags_placeholder: 'تنسيق العلامة هو key=value، استخدم مفتاح Enter أو المسافة للفصل',
  tag: {
    key: {
      label: 'اسم العلامة',
      msg: 'اسم العلامة لا يمكن أن يكون فارغاً',
      duplicate_error: 'لا يسمح بتكرار المفتاح (key)، حيث سيؤدي ذلك إلى عدم مطابقة الأحداث',
      placeholder: 'أدخل أو اختر مفتاح العلامة للمطابقة، مثل app / cluster / alertname',
    },
    func: {
      label: 'العملية الحسابية',
      label_tip: `يدعم العديد من عمليات المطابقة، كما موضح أدناه:
- \`==\` لمطابقة قيمة محددة، يمكن إدخال قيمة واحدة فقط. للمطابقة المتعددة استخدم عملية \`in\`
- \`=~\` إدخال تعبير نمطي (Regex) للمطابقة المرنة
- \`in\` لمطابقة قيم متعددة، تشبه عملية \`in\` في SQL
- \`not in\` لاستبعاد قيم متعددة، تشبه عملية \`not in\` في SQL
- \`!=\` لا يساوي، لاستبعاد قيمة محددة
- \`!~\` عدم مطابقة التعبير النمطي، سيتم استبعاد القيم التي تطابق هذا التعبير، تشبه \`!~\` في PromQL`,
      msg: 'العملية لا يمكن أن تكون فارغة',
    },
    value: {
      label: 'قيمة العلامة',
      placeholder: 'أدخل يدوياً أو اختر قيمة العلامة من القائمة للمطابقة',
      placeholder2: 'أدخل تعبيراً نمطياً (Regex) للمطابقة المرنة لقيم الخصائص',
      msg: 'قيمة العلامة لا يمكن أن تكون فارغة',
    },
    add: 'إضافة علامة جديدة',
  },
  attr: {
    key: {
      label: 'اسم الخاصية',
      msg: 'اسم الخاصية لا يمكن أن يكون فارغاً',
      duplicate_error: 'لا يمكن تكرار اسم الخاصية',
    },
  },
};
export default ar_AE;
