const ar_AE = {
  user: {
    title: 'إدارة المستخدمين',
    search_placeholder: 'اسم المستخدم، البريد الإلكتروني، أو الهاتف',
    create: 'إنشاء مستخدم',
    edit: 'تعديل المستخدم',
    busi_groups: 'مجموعات العمل',
    user_groups: 'الفرق',
    last_active_time: 'آخر وقت نشاط',
  },
  team: {
    title: 'إدارة الفرق',
    list: 'قائمة الفرق',
    search_placeholder: 'اسم المستخدم، الاسم المستعار، البريد الإلكتروني، أو الهاتف',
    create: 'إنشاء فريق',
    edit: 'تعديل الفريق',
    add_member: 'إضافة أعضاء',
    empty: 'لا توجد فرق مرتبطة بك، يرجى القيام بـ ',
    name: 'اسم الفريق',
    add_member_selected: 'تم اختيار {{num}} عنصر',
  },
  business: {
    title: 'إدارة مجموعات العمل',
    list: 'مجموعات العمل',
    search_placeholder: 'اسم مجموعة العمل',
    team_search_placeholder: 'البحث عن اسم الفريق',
    create: 'إنشاء مجموعة عمل',
    edit: 'تعديل مجموعة العمل',
    add_team: 'الفرق المصرح لها',
    perm_flag: 'الصلاحية',
    note_content: 'تنتمي قواعد التنبيه، وأحداث التنبيه، وكائنات المراقبة، ونصوص الإصلاح التلقائي إلى مجموعات العمل؛ وهي تمثل منظمة ذاتية الإدارة داخل النظام.',
    empty: 'مجموعة العمل فارغة (يجب أن تنتمي كائنات المراقبة، ولوحات البيانات، وقواعد التنبيه، ونصوص الإصلاح التلقائي إلى مجموعة عمل)، يرجى القيام بـ ',
    name: 'اسم مجموعة العمل',
    name_tip: `
      سيتم العرض على شكل هيكل شجري عند استخدام الفاصل {{separator}} <1 />
      مثال: redis{{separator}}مراقبة و redis{{separator}}تسجيل دخول ستظهر كالتالي: <1 />
      redis <1 />
      - مراقبة <1 />
      - تسجيل دخول <1 />
    `,
    team_name: 'الفرق المصرح لها',
    team_name_tip: 'الفرق التالية يمكنها إدارة مجموعة العمل هذه',
    perm_flag_0: 'قراءة فقط',
    perm_flag_1: 'قراءة وكتابة',
    user_group_msg: 'لا يمكن ترك فرق مجموعة العمل فارغة',
  },
  disbale: 'تعطيل',
  enable: 'تفعيل',
  ok_and_search: 'تأكيد وبحث',
};
export default ar_AE;
