const ar_AE = {
  es: {
    ref: 'الاسم',
    index: 'الفهرس',
    index_tip: `
      يدعم عدة طرق للإعداد
      <1 />
      1. تحديد فهرس واحد مثل gb للبحث في جميع المستندات داخل فهرس gb
      <1 />
      2. تحديد عدة فهارس مثل gb,us للبحث في جميع المستندات ضمن فهارس gb و us
      <1 />
      3. تحديد بادئة الفهرس مثل g*,u* للبحث في أي فهرس يبدأ بالحرف g أو u
      <1 />
      `,
    index_msg: 'لا يمكن ترك الفهرس فارغاً',
    indexPattern: 'نمط الفهرس',
    indexPatterns: 'أنماط الفهارس',
    indexPattern_msg: 'نمط الفهرس لا يمكن أن يكون فارغاً',
    indexPatterns_manage: 'إدارة أنماط الفهارس',
    filter: 'شروط التصفية',
    syntax: 'الصيغة',
    time_label: 'دقة الوقت',
    date_field: 'حقل التاريخ',
    date_field_msg: 'حقل التاريخ لا يمكن أن يكون فارغاً',
    interval: 'الفاصل الزمني',
    value: 'استخراج القيم',
    func: 'الدالة',
    funcField: 'اسم الحقل',
    terms: {
      label: 'التجميع حسب الحقل المحدد',
      more: 'إعدادات متقدمة',
      size: 'عدد النتائج المطابقة',
      min_doc_count: 'الحد الأدنى لعدد المستندات',
    },
    raw: {
      limit: 'عدد السجلات',
      date_format: 'تنسيق التاريخ',
      date_format_tip: 'استخدم تنسيق Moment.js مثل YYYY-MM-DD HH:mm:ss.SSS',
    },
    alert: {
      query: {
        title: 'إحصائيات الاستعلام',
        preview: 'معاينة البيانات',
      },
      trigger: {
        title: 'شروط التنبيه',
        builder: 'الوضع البسيط',
        code: 'وضع التعبير',
        label: 'الربط مع Label',
      },
      prom_eval_interval_tip: 'يتم تنفيذ الاستعلام كل {{num}} ثانية على التخزين الخلفي',
      prom_for_duration_tip:
        'عادةً تكون مدة الاستمرار أطول من فترة التنفيذ، وخلال هذه المدة يتم تنفيذ الاستعلام عدة مرات وفق فترة التنفيذ، ولا يتم إنشاء التنبيه إلا إذا تحققت الشروط في كل مرة. إذا تم تعيين المدة إلى 0 فهذا يعني أنه بمجرد تحقق الشرط مرة واحدة سيتم إنشاء التنبيه',
      advancedSettings: 'إعدادات متقدمة',
      delay: 'تنفيذ مؤجل',
    },
    event: {
      groupBy: 'التجميع حسب {{field}}، عدد النتائج {{size}}، الحد الأدنى للمستندات {{min_doc_count}}',
      logs: {
        title: 'تفاصيل السجلات',
        size: 'عدد النتائج',
        fields: 'تصفية الحقول',
        jsonParseError: 'فشل التحليل',
      },
    },
    syntaxOptions: 'خيارات الصيغة',
    queryFailed: 'فشل تنفيذ الاستعلام، يرجى المحاولة لاحقاً',
    offset_tip: 'يُستخدم للاستعلام عن البيانات قبل فترة زمنية محددة، مشابه لـ offset في PromQL، والوحدة بالثواني',
  },
  datasource: {
    max_query_rows: 'أقصى عدد صفوف يمكن جلبها في الطلب الواحد',
    max_idle_conns: 'الحد الأقصى للاتصالات الخاملة',
    max_open_conns: 'الحد الأقصى للاتصالات المفتوحة',
    conn_max_lifetime: 'أقصى مدة حياة للاتصال (بالثواني)',
    timeout: 'المهلة الزمنية (بالثواني)',
    timeout_ms: 'المهلة الزمنية (بالمللي ثانية)',
  },
  query: {
    title: 'إحصائيات الاستعلام',
    execute: 'تنفيذ الاستعلام',
    query: 'شروط الاستعلام',
    query_required: 'لا يمكن ترك شرط الاستعلام فارغاً',
    query_placeholder: 'أدخل أمر SQL للاستعلام، استخدم Shift+Enter للانتقال لسطر جديد',
    query_placeholder2: 'اضغط Shift+Enter للانتقال لسطر جديد',
    advancedSettings: {
      title: 'الإعدادات المساعدة',
      tags_placeholder: 'اضغط Enter لإدخال عدة عناصر',
      valueKey: 'حقل القيمة',
      valueKey_tip: 'عادةً تحتوي نتائج SQL على عدة أعمدة، يمكنك تحديد الأعمدة التي سيتم استخدامها كقيم للرسم البياني',
      valueKey_required: 'حقل القيمة لا يمكن أن يكون فارغاً',
      labelKey: 'حقل الوسم',
      labelKey_tip: 'يمكنك تحديد الأعمدة التي ستُستخدم كوسوم تعريفية لمنحنيات الرسم البياني',
    },
  },
};
export default ar_AE;
