const ar_AE = {
  preview: 'معاينة البيانات',
  query: {
    title: 'إحصائيات الاستعلام',
    execute: 'استعلام',
    project: 'المشروع',
    project_msg: 'يرجى اختيار المشروع',
    project_tip: `
      <1>المشروع هو وحدة إدارة الموارد في خدمة السجلات، وهو الحدود الرئيسية لعزل المستخدمين والتحكم في الوصول. لمزيد من المعلومات، يرجى مراجعة<1>
      <2>المشروع</2>
    `,
    logstore: 'مخزن السجلات (Logstore)',
    logstore_msg: 'يرجى اختيار مخزن السجلات',
    logstore_tip: `
      <1>مخزن السجلات هو وحدة الجمع والتخزين والاستعلام عن بيانات السجلات في خدمة السجلات. لمزيد من المعلومات، يرجى مراجعة<1>
      <2>مخزن السجلات</2>
    `,
    range: 'نطاق الاستعلام',
    power_sql: 'تعزيز SQL',
    query: 'شروط الاستعلام',
    query_msg: 'يرجى إدخال شروط الاستعلام',
    query_tip1: 'يمكن الرجوع إلى قواعد استعلام TDengine في',
    query_tip2: 'الوثائق الرسمية',
    sqlTemplates: 'قوالب الاستعلام',
    sqlTemplates_tip: 'شروط استعلام SQL التالية هي للإشارة فقط؛ عند الاستخدام الفعلي، يجب استبدال $المتغير بالقيم الحقيقية',
    mode: {
      timeSeries: 'سلاسل زمنية',
      raw: 'السجلات الأصلية',
    },
    advancedSettings: {
      title: 'إعدادات مساعدة',
      metricKey_tip:
        'استخدم هذا الحقل لتحديد الحقول التي ستعمل كـ metricName. افتراضياً، يتم استخدام الحقول الرقمية كـ metricName. مثال: إذا كانت النتيجة used_percent:96 host:host01، سيصبح used_percent هو اسم المقياس والقيمة 96',
      tags_placeholder: 'اضغط Enter لإدخال قيم متعددة',
      labelKey_tip:
        'استخدم هذا الحقل لتحديد الحقول التي ستعمل كـ labelName. افتراضياً، يتم استخدام الحقول غير الرقمية كـ labelName. مثال: إذا كانت النتيجة used_percent:96 host:host01، سيصبح host هو اسم العلامة (Label) و host01 هو قيمتها',
      timeKey_tip: 'تحديد الحقل الزمني الذي سيُستخدم كمحور X في الرسوم البيانية',
      timeFormat_tip: 'تنسيق الوقت، سيتم تحويل الوقت إلى طابع زمني (Timestamp) بناءً على هذا التنسيق',
    },
    schema: 'معلومات الهيكل (Schema)',
    table: 'جدول عادي',
    stable: 'جدول فائق (STable)',
  },
  trigger: {
    title: 'شروط التنبيه',
    value_msg: 'يرجى إدخال قيمة التعبير',
  },
};
export default ar_AE;
