const ar_AE = {
  title: 'ترحيل لوحة القيادة',
  migrate: 'ترحيل (Migrate)',
  help: `
  الإصدار v6 لن يدعم تبديل عناقيد Prometheus العالمية (Global clusters). الإصدار الجديد يحقق هذه الإمكانية من خلال ربط متغيرات مصدر البيانات (Data Source Variables) بالرسوم البيانية.
  <br />
  ستقوم أداة الترحيل بإنشاء متغيرات مصادر البيانات وربط جميع الرسوم البيانية التي لم يتم ربطها بعد بمصدر بيانات.
  <br />
  فيما يلي قائمة بلوحات القيادة الجاهزة للترحيل؛ انقر فوق زر "ترحيل" لبدء العملية.
  `,
};
export default ar_AE;
